/*Задача 1. Напишете функция, която принтира низ, пойнтера към
началото му е подаден като аргумент на функцията void printstr(char *s); Не
забравяйте, низът винаги завършва с знак за терминираща нула '\0', затова
проверката в цикъла, който принтира всеки чаръктър, трябва да е докато не
се стигне този знак*/
#include <stdio.h>
#include<ctype.h>
void print(char *s){
 
  int c = 0;

   if (s[c] != '\0') { 
     do {
       printf("%c", s[c]);
       c++;
     } while (s[c] != '\0');
   }

}

int main(){
    char s[]="Hello\n";
    print(s);
  
   return 0;
}