/*Задача 2. Напишете функцията int atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до . точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място. */
#include <stdio.h>
#include<ctype.h>
#include<string.h>
float atof(char *s){
 float result;
 int power=1;
 int n;
int i;
n = 0;
    
         for(i = 0; (s[i] >= '0' && s[i] <= '9')||s[i]=='.'; i++){
             if(s[i]!='.'){
            n = 10 * n + (s[i] - '0');
             }else{
                 for(int c=i;(s[c+1] >= '0' && s[c+1] <= '9'); c++){
                 power*=10;
                 }
             }
        }
       

return result=(float)n/power;

}


int main(){
    char s[]="123.69";
    float result=atof(s);
    printf("%f\n ",result);
    atof(s);
   return 0;
}